{
    "blurb": "Throughout my experience working in corporate and startup environments, whether contributing technically or guiding development, I ramp up quickly to deliver impact. I love to dive into new spaces, get curious, and learn fast to deliver real solutions to root problems. My diverse and wide background allows me to assess problems from various perspectives and develop a unique approach. I’m looking forward to diving into a new dynamic environment, continuing to deliver impact and learn.",
    "general": {
        "citizenship": ["United States of America", "Hungary"],
        "education": {
            "degree": ["B.Sc. Computer Science", "B.Sc. Mathematics"],
            "school": "Duke University",
            "interval": ["2019-08-01", "2023-05-01"]
        },
        "languages": [
            { "language": "English", "level": "fluent" },
            { "language": "Hungarian", "level": "fluent" },
            { "language": "German", "level": "B2" }
        ],
        "contact": {
            "linkedin": "linkedin.in/zsofiawalter",
            "germanNumber": "+49152",
            "usNumber": "17572324554",
            "github": "github.com"
        }
    },
    "experiences": [
        {
            "type": "work",
            "name": "PowerUs",
            "team": "Job Matching",
            "title": "Product Management Intern",
            "interval": ["2023-09-01", "2024-02-29"],
            "location": "Berlin, Germany",
            "description": [
                "Led a feature to improve matching performance from opportunity identification to launch. Ran ideation sessions and prototype testing, and managed stakeholders. Post-launch monitored use and adjusted feature.",
                "Conducted user interviews in German - selected user group, assumptions and hypotheses to validate, created interview guide and condensed learnings.",
                "Improved and automated user interview scheduling, decreasing time spent scheduling by 80%, and increasing response rate to 25% from 17%."
            ],
            "skills": [
                "User Interviews",
                "HotJar",
                "Jira",
                "MixPanel",
                "Notion",
                "Data Analysis"
            ]
        },
        {
            "type": "work",
            "name": "Microsoft",
            "team": "Word Online",
            "title": "Software Engineering Intern",
            "interval": ["2022-05-01", "2022-07-01"],
            "location": "Redmond, WA, USA",
            "description": [
                "Converted legacy Word Online UI to implement React, enabling dark mode compatibility, and tracked changes through full feature lifecycle.",
                "Optimized performance of UI elements, discovered and fixed UI bugs.",
                "Completed project in half expected time, expanded scope by incorporating a partner team's smart feature, enabling feature rollout with React functionality."
            ],
            "skills": ["TypeScript", "GitHub"]
        },
        {
            "type": "work",
            "name": "Microsoft",
            "team": "Bing Index Spam Detection",
            "title": "Explore (SWE & PM) Intern",
            "interval": ["2021-05-01", "2021-07-01"],
            "location": "Redmond, WA, USA",
            "description": [
                "Improved Bing Index spammy URL detection by extracting features such as dwell time from user data, and outlink percentage on page to create a random decision tree model to identify and eliminate spammy results.",
                "Increased efficiency of greater team with the model generated by reducing data to parse by 25% with 90% confidence."
            ],
            "skills": ["SQL", "C#"]
        },
        {
            "type": "project",
            "name": "Thrifty Carrot",
            "title": "Project Lead",
            "interval": ["2022-06-01", "2022-12-01"],
            "location": "Durham, NC",
            "description": [
                "Web platform to facilitate user grocery budgeting via two methods: planning shopping lists using scraped grocery data and analyzing previous expenditures.",
                "Conducted user research via interviews and surveys, developed user persona, and created website mockup using user journeys and wireframes. ",
                "Scraped product information from grocery store website into database, and developed New Cart and Preferences features. ",
                "Led team of five in developing features: Users, Old Carts, Cart Analytics, etc."
            ],
            "skills": [
                "PostgreSQL",
                "Python",
                "Flask",
                "GitHub",
                "Selenium",
                "Figma"
            ]
        },
        {
            "type": "project",
            "name": "DigiDJ",
            "title": "Project Lead",
            "interval": ["2022-11-01", "2022-12-20"],
            "location": "Durham, NC",
            "description": [
                "Hand-held device that allows the user to modulate speed and pitch of music, set loops, and play sound effects through combinations of tilting and touch pad inputs. ",
                "Designed and built solution through an iterative design process to MVP."
            ],
            "skills": [
                "Circuit Python",
                "Max MSP",
                "Circuit Playground Express",
                "Fusion 360",
                "3D Printing"
            ]
        },
        {
            "type": "leadership",
            "name": "Duke Varsity Fencing Team",
            "title": "Women's Team Captain",
            "interval": ["2022-05-01", "2023-05-01"],
            "location": "Durham, NC",
            "description": [
                "Lead 20 women through 8 months of training, practiced 17 hours per week culminating in 8 collegiate meets, while implementing a new training regimen.",
                "Organized donation campaign to raise $72,979 for breast cancer research.",
                "Results: 2023 NCAA Championship Qualifier, Women's Team 2021 ACC Champions, 7th Place Division 1 2022 North American Cup"
            ],
            "skills": ["Leadership", "Communication", "Teamwork", "Mentorship"]
        },
        {
            "type": "Leadership",
            "name": "Scale &amp; Coin Business Society",
            "title": "VP Technology",
            "interval": ["2021-08-01", "2022-12-01"],
            "location": "Durham, NC",
            "description": [
                "Designed S&amp;C's website and created content to inform prospective members and guest speakers using a website builder, utilized a clean and modern design."
            ],
            "skills": ["Communication", "Web Design", "Mentorship"]
        }
    ]
}
